BEGIN;

CREATE DATABASE curriculum_generator_app;

USE curriculum_generator_app;

CREATE TABLE minors (
	id INT AUTO_INCREMENT PRIMARY KEY,
	name VARCHAR(255) NOT NULL UNIQUE,
	abbreviation VARCHAR(8)
);

CREATE TABLE departments (
	id INT AUTO_INCREMENT PRIMARY KEY,
	name VARCHAR(255) NOT NULL UNIQUE
);

CREATE TABLE lecturers (
	id INT AUTO_INCREMENT PRIMARY KEY,
	department_id INT REFERENCES department.id ON DELETE CASCADE ON UPDATE CASCADE,
	titles VARCHAR(50) NOT NULL,
	names VARCHAR(255) NOT NULL,
	UNIQUE (titles, names)
);

CREATE TABLE synopses (
	course_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	position INT NOT NULL CHECK ( position >= 1 ),
	description TEXT NOT NULL,
	horarium_lectures INT NOT NULL CHECK ( horarium_lectures >= 0 ),
	horarium_seminars INT NOT NULL CHECK ( horarium_seminars >= 0 ),
	horarium_practice INT NOT NULL CHECK ( horarium_practice >= 0 ),
	PRIMARY KEY (course_id, position)
);

CREATE TABLE exams_synopses (
	course_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	position INT NOT NULL CHECK ( position >= 1 ),
	description TEXT NOT NULL,
	PRIMARY KEY (course_id, position)
);

CREATE TABLE bibliographies (
	course_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	position INT NOT NULL CHECK ( position >= 1 ),
	content TEXT NOT NULL,
	PRIMARY KEY (course_id, position)
);

CREATE TABLE course_dependencies (
	parent_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	child_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	PRIMARY KEY (parent_id, child_id)
);

CREATE TABLE courses_minors (
	course_id INT NOT NULL REFERENCES course.id ON DELETE CASCADE ON UPDATE CASCADE,
	minor_id INT NOT NULL REFERENCES minor.id ON DELETE CASCADE ON UPDATE CASCADE,
	PRIMARY KEY (course_id, minor_id)
);

CREATE TABLE courses (
	id INT AUTO_INCREMENT PRIMARY KEY,
	name VARCHAR(255) NOT NULL UNIQUE,
	lecturer_id INT NOT NULL REFERENCES lecturer.id,
	credits INT NOT NULL CHECK ( credits >= 0 ),
	lecture_engagement INT NOT NULL CHECK ( lecture_engagement >= 0 ),
	seminar_engagement INT NOT NULL CHECK ( seminar_engagement >= 0 ),
	practice_engagement INT NOT NULL CHECK ( practice_engagement >= 0 ),
	homework_engagement INT NOT NULL CHECK ( homework_engagement >= 0 ),
	test_prep_engagement INT NOT NULL CHECK ( test_prep_engagement >= 0 ),
	course_project_engagement INT NOT NULL CHECK ( course_project_engagement >= 0 ),
	self_study_engagement INT NOT NULL CHECK ( self_study_engagement >= 0 ),
	study_report_engagement INT NOT NULL CHECK ( study_report_engagement >= 0 ),
	other_extracurricular_engagement INT NOT NULL CHECK ( other_extracurricular_engagement >= 0 ),
	exam_prep_engagement INT NOT NULL CHECK ( exam_prep_engagement >= 0 ),
	course_project_grade_percentage INT NOT NULL CHECK ( course_project_grade_percentage >= 0 AND course_project_grade_percentage <= 100 ),
	tests_grade_percentage INT NOT NULL CHECK ( tests_grade_percentage >= 0 AND tests_grade_percentage <= 100 ),
	exam_grade_percentage INT NOT NULL CHECK ( exam_grade_percentage >= 0 AND exam_grade_percentage <= 100 ),
	headnote TEXT NOT NULL,
	prerequisites TEXT NOT NULL,
	expected_results TEXT NOT NULL,
	created_at DATE NOT NULL,
	updated_at DATE NOT NULL,
	CHECK ( course_project_grade_percentage + tests_grade_percentage + exam_grade_percentage = 100 )
);

INSERT INTO departments (name)
VALUES
('Алгебра'),
('Вероятности, операционни изследвания и статистика'),
('Геометрия'),
('Диференциални уравнения'),
('Информационни технологии'),
('Комплексен анализ и топология'),
('Компютърна информатика'),
('Математическа логика и приложенията ѝ'),
('Математически анализ'),
('Мехатроника, роботика и механика'),
('Обучение по математика и информатика'),
('Софтуерни технологии'),
('Числени методи и алгоритми'),
('Изследователи към ФМИ');

INSERT INTO lecturers (department_id, titles, names)
VALUES
(1, 'проф. д-р', 'Азнив Киркор Каспарян'),
(5, 'гл. ас. д-р', 'Албена Емилова Антонова'),
(14, 'изсл. (r4) проф. дн', 'Александра Андреева Соскова'),
(10, 'доц. д-р', 'Александър Алексиев Стефанов'),
(6, 'гл. ас. д-р', 'Александър Василев Александров'),
(3, 'доц. д-р', 'Александър Владимиров Петков'),
(12, 'доц. д-р', 'Александър Димов'),
(13, 'гл. ас. д-р', 'Ана Александрова Авджиева'),
(10, 'гл. ас. д-р', 'Анастасиос Георгиос Папапостолу'),
(2, 'гл. ас. д-р', 'Ангел Георгиев Ангелов'),
(7, 'ас.', 'Ангел Иванов Димитриев'),
(4, 'доц. д-р', 'Ангел Иванов Живков'),
(8, 'гл. ас. д-р', 'Андрей Константинов Сариев'),
(8, 'гл. ас. д-р', 'Антон Кирилов Зиновиев'),
(1, 'доц. д-р', 'Асен Иванов Божилов'),
(3, 'проф. дн', 'Ася Петрова Русева'),
(7, 'доц. д-р', 'Атанас Цветанов Семерджиев'),
(3, 'доц. д-р', 'Богдан Тодоров Александров'),
(10, 'доц. д-р', 'Богдана Атанасова Георгиева'),
(12, 'ас.', 'Борис Людмилов Величков'),
(9, 'доц. д-р', 'Борислав Радков Драганов'),
(11, 'гл. ас. д-р', 'Борислава Кирилова Виденова'),
(12, 'проф. д-р', 'Боян Паскалев Бончев'),
(5, 'доц. д-р', 'Валерия Николаева Симеонова'),
(7, 'проф. д-р', 'Васил Георгиев Цунижев'),
(6, 'гл. ас. д-р', 'Васил Станев Гочев'),
(4, 'ас.', 'Венета Стайкова Колева'),
(2, 'доц. д-р', 'Весела Кирилова Стоименова'),
(13, 'доц. д-р', 'Веселин Андреев Гушев'),
(11, 'гл. ас. д-р', 'Веселин Руенов Дзивев'),
(8, 'гл. ас. д-р', 'Владислав Владимиров Ненчев'),
(13, 'гл. ас. д-р', 'Галина Стоянова Люцканова-Жекова'),
(13, 'проф. дн', 'Гено Петков Николов'),
(10, 'проф. д-р', 'Георги Венциславов Бояджиев'),
(8, 'д-р мат.', 'Георги Иванов Георгиев'),
(12, 'ас.', 'Георги Христов Къдрев'),
(11, 'ас.', 'Гюнер Халим Пасаж'),
(14, 'изсл. (r2) д-р', 'Даниела Мартинез Корреа'),
(7, 'доц. д-р', 'Дафина Йорданова Петкова'),
(5, 'гл. ас. д-р', 'Дафинка Савова Митева'),
(2, 'гл. ас. д-р', 'Деница Парашкевова Григорова'),
(12, 'проф. д-р', 'Десислава Георгиева Петрова-Антонова'),
(2, 'гл. ас. д-р', 'Детелина Кирилова Камбурова'),
(6, 'ас.', 'Деян Живков Джундреков'),
(1, 'гл. ас. д-р', 'Диана Илиева Радкова'),
(10, 'гл. ас. д-р', 'Димитар Трайко Недановски'),
(NULL, 'мат.', 'Димитър Асенов Шиячки'),
(7, 'доц. д-р', 'Димитър Георгиев Димитров'),
(8, 'гл. ас. д-р', 'Добромир Павлов Кралчев'),
(9, 'проф. дн', 'Дойчин Иванов Толев'),
(2, 'доц. д-р', 'Дончо Стефанов Дончев'),
(NULL, 'мат.', 'Евгени Петров Недялков'),
(10, 'проф. д-р', 'Евгений Христов Кръстев'),
(1, 'доц. д-р', 'Евгения Димитрова Великова'),
(5, 'проф. д-р', 'Елиза Петрова Стефанова'),
(12, 'доц. д-р', 'Елисавета Василева Гурова'),
(5, 'гл. ас. д-р', 'Елица Василева Пелтекова'),
(2, 'гл. ас. д-р', 'Емил Петков Каменов'),
(1, 'ас.', 'Емилиян Иванов Рогачев'),
(9, 'гл. ас. д-р', 'Живко Христов Петров'),
(NULL, 'д-р пр.', 'Жулгена Бенбасат - Банкова'),
(NULL, 'мат.', 'Здравка Димитрова Иванова'),
(7, 'доц. д-р', 'Иван Георгиев Христов'),
(8, 'доц. д-р', 'Иван Димитров Георгиев'),
(9, 'доц. д-р', 'Иван Иванов Гаджев'),
(12, 'проф. д-р', 'Иван Колев Койчев'),
(3, 'доц. дн', 'Иван Минчев Минчев'),
(10, 'доц. д-р', 'Иван Николов Чавдаров'),
(12, 'ас.', 'Ирена Атанасова Павлова'),
(5, 'гл. ас. д-р', 'Ирена Юлкова Авджиева'),
(11, 'доц. д-р', 'Ирина Здравкова Вутова'),
(1, 'ас.', 'Йоана Евгениева Петкова'),
(7, 'доц. д-р', 'Йоаннис Парменион Патиас'),
(7, 'доц. д-р', 'Калин Георгиев Николов'),
(7, 'проф. д-р', 'Калинка Михайлова Калоянова'),
(10, 'доц. д-р', 'Калоян Мариянов Йовчев'),
(14, 'изсл. (r4) проф. д-р', 'Камен Кръстев Делчев'),
(1, 'гл. ас. д-р', 'Константин Драганов Табаков'),
(5, 'проф. д-р', 'Красен Стефанов Стефанов'),
(6, 'доц. д-р', 'Красимира Влъчкова Александрова'),
(7, 'гл. ас. д-р', 'Кристина Янева Арнаудова'),
(5, 'ас.', 'Лиляна Иванова Русенова'),
(13, 'доц. д-р', 'Лозко Божинов Милев'),
(6, 'гл. ас. д-р', 'Любомир Владимиров Андреев'),
(14, 'изсл. (r1)', 'Маргарита Николаева Николова'),
(5, 'доц. д-р', 'Мариана Илиева Атанасова'),
(3, 'ас.', 'Марина Павлова Чомакова'),
(NULL, 'мат.', 'Мария Василева Конова'),
(4, 'доц. д-р', 'Мария Георгиева Каратопраклиева'),
(7, 'проф. д-р', 'Мария Михайлова Нишева'),
(13, 'ас.', 'Мария Николова Зарчева'),
(NULL, 'мат.', 'Мария Петкова Колева'),
(14, 'изсл. (r1)', 'Мартин Йорданов Минчев'),
(2, 'проф. дн', 'Марусия Никифорова Божкова'),
(14, 'изсл. (r1) д-р', 'Матей Боянов Константинов'),
(1, 'проф. д-р', 'Мая Митева Стоянова'),
(2, 'гл. ас. д-р', 'Мая Проданова Желязкова'),
(7, 'ас.', 'Мелания Стоянова Бербатова'),
(12, 'проф. д-р', 'Милен Йорданов Петров'),
(9, 'доц. д-р', 'Милко Дамянов Такев'),
(8, 'доц. д-р', 'Минко Маринов Марков'),
(9, 'гл. ас. д-р', 'Мира Изак Бивас'),
(2, 'гл. ас. д-р', 'Михаил Атанасов Хамамджиев'),
(2, 'проф. дн', 'Михаил Иванов Кръстанов'),
(2, 'проф. дн', 'Младен Светославов Савов'),
(9, 'проф. дн', 'Надежда Костадинова Рибарска'),
(2, 'проф. дн', 'Надя Пейчева Златева'),
(NULL, 'д-р мат.', 'Невяна Димитрова Георгиева'),
(13, 'доц. д-р', 'Никола Георгиев Найденов'),
(9, 'доц. д-р', 'Николай Антонов Иванов'),
(14, 'изсл. (r2) доц. д-р', 'Николай Митов Николов'),
(NULL, 'д-р мат.', 'Николай Петров Буюклиев'),
(11, 'доц. д-р', 'Николина Илиева Николова'),
(7, 'доц. д-р', 'Нора Ангелова Ангелова'),
(4, 'проф. дн', 'Огнян Борисов Христов'),
(12, 'проф. д-р', 'Олга Илиева Георгиева'),
(5, 'гл. ас. д-р', 'Олег Димитров Константинов'),
(5, 'проф. д-р', 'Павел Христов Бойчев'),
(1, 'гл. ас. д-р', 'Панчо Георгиев Бешков'),
(5, 'ст. пр.', 'Пенчо Петров Михнев'),
(10, 'ас.', 'Петър Дойчев Георгиев'),
(8, 'гл. ас. д-р', 'Петър Николев Митанкин'),
(7, 'доц. д-р', 'Петър Русланов Армянов'),
(9, 'доц. д-р', 'Първан Евтимов Първанов'),
(7, 'доц. д-р', 'Радослава Данаилова Христова'),
(NULL, 'ст. пр.', 'Радостина Михалева'),
(11, 'гл. ас. д-р', 'Райна Милкова Алашка'),
(NULL, 'ст. пр. д-р', 'Рени Радкова Бунева'),
(13, 'доц. д-р', 'Румен Костадинов Улучев'),
(6, 'гл. ас. д-р', 'Руси Георгиев Йорданов'),
(NULL, 'мат.', 'Сабина Стефанова Бочева'),
(4, 'гл. ас. д-р', 'Светлин Георгиев Георгиев'),
(1, 'доц. д-р', 'Силвия Първанова Бумова'),
(12, 'проф. д-р', 'Силвия Христова Илиева'),
(10, 'доц. д-р', 'Симеон Емилов Цветанов'),
(12, 'гл. ас. д-р', 'Сия Валентинова Цолова'),
(11, 'ас.', 'Станислав Господинов Иванов'),
(10, 'доц. д-р', 'Стела Иванова Русева'),
(8, 'доц. д-р', 'Стела Колева Николова'),
(8, 'доц. д-р', 'Стефан Владимиров Герджиков'),
(8, 'гл. ас. д-р', 'Стефан Володев Вътев'),
(3, 'проф. дн', 'Стефан Петров Иванов'),
(9, 'гл. ас. д-р', 'Стоян Райчев Апостолов'),
(14, 'изсл. (r3) доц. д-р', 'Таня Георгиева Тонова'),
(1, 'гл. ас. д-р', 'Татяна Любенова Тодорова'),
(5, 'доц. д-р', 'Теменужка Борисова Зафирова-Малчева'),
(14, 'изсл. (r4) проф. д-р', 'Тинко Величков Тинчев'),
(13, 'гл. ас. д-р', 'Тихомир Богословов Иванов'),
(4, 'доц. д-р', 'Тодор Павлов Попов'),
(NULL, 'мат.', 'Траян Славчев Илиев'),
(7, 'доц. д-р', 'Трифон Анчев Трифонов'),
(11, 'доц. д-р', 'Филип Петров Петров'),
(8, 'доц. д-р', 'Христо Александров Ганчев'),
(4, 'доц. д-р', 'Цветан Димитров Христов'),
(4, 'гл. ас. д-р', 'Цветана Любенова Стоянова'),
(2, 'ас.', 'Цветомира Ангелова Златкова'),
(14, 'изсл. (r2) д-р', 'Шехмус Фъндък'),
(3, 'доц. д-р', 'Юлиан Цанков Цанков'),
(14, 'изсл. (r2) д-р', 'Юрий Владимиров Цукровски'),
(12, 'гл. ас. д-р', 'Явор Иванов Данков'),
(3, 'гл. ас. д-р', 'Яна Алексиева Алексиева');


INSERT INTO minors (name, abbreviation)
VALUES
('Информатика', 'И'),
('Информационни системи', 'ИС'),
('Компютърни науки', 'КН'),
('Софтуерно инженерство', 'СИ'),
('Анализ на данни', 'АД'),
('Математика', 'M'),
('Приложна математика', 'ПМ'),
('Статистика', 'Стат'),
('Математика и информатика', 'МИ');

INSERT INTO `courses` VALUES
(9,'Приложно-програмни интерфейси за работа с облачни архитектури с Амазон Уеб Услуги (AWS)',99,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(1,'ООП',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(2,'СДП',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(3,'Алгебра |',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(4,'ДИС |',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(5,'Програмиране с Go',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(6,'Machine learning',1,5,30,0,30,0,0,30,30,30,0,0,40,20,40,'Дисциплината адресира необходимото ниво знания на за създаване на архитектурни\r\nрешения с уеб услуги на Амазон (AWS). Предвидено е постепенно представяне на\r\nинформацията и постепенно надграждане на знанията. Дисциплината въвежда някои от\r\nнай-често използваните услуги на Амазон Уеб Услуги и приложно-програмните\r\nинтерфейси свързани с тях– теория и практически примери. Разглеждат се и различни\r\nаспекти от сигурността при разработване и използване на AWS.','Операционни системи: Линукс, основни познания за вътрешни Shell команди\r\nМрежи: основни и малко по-задълбочени познания – адресиране (IP), маски, шлюзове,\r\nпротоколи (HTTP/HTTPS), Telnet/SSH;\r\nРаботно владеене на някакъв текстообработващ редактор, работещ под Линукс','След завършване на курса студентите ще могат да:\r\n1. Разграничават различните облачни архитектури;\r\n2. Ще могат да описват основните Амазон AWS услуги и приложно програмни\r\nинтерфейси;\r\n3. Ще имат разбирането и знанията за внимателно използване на ресурсите в облачните\r\nинфраструктури;\r\n4. Да създават API обръщения – през CLI команди и през някои от съществуващите SDK-\r\nта на Амазон;\r\n5. Ще могат свободно за използват Уеб конзолата на Амазон за AWS.\r\n6. Ще могат да създават основни AWS архитектури;\r\n7. Ще получат необходимата основа отговаряща на знанията в сертификационния изпит\r\nна Амазон „AWS Certified Solution Architect – Associate”','2024-01-02','2024-01-02'),
(10,'Дизайн и анализ на алгоритми (практикум)',35,0,0,0,45,20,35,0,10,0,0,10,0,40,60,'Практикумът тренира уменията за програмиране и решаване на практически задачи.\r\nИзграждат се умения за работа с основни структури данни (стек, опашка, списък,\r\nпирамида, структури \'union-find\'), студентите се обучават да ползват\r\nалгоритмичната библиотека STL.\r\nРешават се задачи, които се свеждат до основни алгоритми: сортировки и търсене,\r\nобхождане на графи, екстремални задачи върху графи.\r\nДруго направление е свеждането на задачи към известни алгоритмични схеми:\r\nдинамично програмиране, разделяй и владей, жадни алгоритми.\r\nОбучението протича под формата на състезателно програмиране: решенията на\r\nвсички задачи се подават към състезателна система, която ги тества върху\r\nпредварително подготвени входни данни.','Успешно взети изпити по Дискретни Структури, Основи на Програмирането и\r\nЕзици, Автомати и Изчислимост.\r\nПаралелно участие (или взет изпит) в курса Дизайн и Анализ на Алгоритми.','Студентите да придобият реален опит в програмирането, отстраняването на грешки\r\nи тестването на програмите.','2024-01-20','2024-01-20');
INSERT INTO `courses_minors` VALUES (9,1),(9,2),(9,3),(9,4),(10,1),(10,3);
INSERT INTO `exams_synopses` VALUES (9,1,'Област 1: Дизайн на Еластични Архитектури\r\n1.1. Избор на механизми за надеждно/еластично съхранение.\r\n1.2. Дизайн на решения с многослойни архитектури.\r\n1.3. Дизайн на високо надеждни и/или устойчиви на грешки архитектури.'),(9,2,'Област 2: Дефиниране на Производителни Архитектури\r\n2.1. Избор на производителни системи за съхранение и бази данни.\r\n2.2. Прилагане на кеширане за подобрение на производителността.\r\n2.3. Дизайн на решения за еластичност и мащабируемост.'),(9,3,'Област 3: Определяне на Сигурни Приложения и Архитектури\r\n3.1 Определяне на стратегии при защита на приложните слоеве.\r\n3.2 Определяне на стратегии при защита на данните.\r\n3.3 Определяне на мрежова инфраструктура за приложения в дадено Виртуално Частно\r\nОблачно Пространство (VPC).'),(9,4,'Област 4: Дизайн на Оптимизирани по Отношение на Разходите Архитектури\r\n4.1 Дизайн на място за съхранение на данни, оптимизирано по отношение на разходите.\r\n4.2 Дизайн на изчислителни ресурси, оптимизирани по отношение на разходите.'),(9,5,'Област 5: Определяне на Архитектури, Готови за Експлоатация\r\n5.1 Избор на характеристики при дизайн на решения и свързаните с тях приложно-\r\nпрограмни интерфейси, които дават възможност за оперативни постижения.');
INSERT INTO `synopses` VALUES (9,1,'Основни концепции:\r\n- Мрежи (DNS, IP адреси, маскиране);\r\n- Сигурност;\r\n- Операционни системи (Линукс);',2,0,2),(9,2,'Основи на Амазон AWS:\r\n- Региони; AZs; Крайни Локации; Акаунти; ARNs; Тагове;\r\n- Конзола, CLI, APIs',2,0,2),(9,3,'Амазон Виртуално Частно Облачно Пространство (VPC);',2,0,2),(9,4,'Амазон Еластично Компютърно Пространство (EC2) и Амазон\r\nЕластично Блоково Пространство (EBS):\r\n- Типове виртуални машини; достъп; Имиджи (AMIs); бекъпи; - част\r\n2',2,0,2),(9,5,'Системен Мениджър:\r\n- Документи;\r\n- Място за съхранение на параметри;',2,0,2),(9,6,'Амазон Услуга за Лесно Съхранение (Амазон S3) и Амазон Услуга\r\nза Продължително Съхранение (Glacier) - част 1',2,0,2),(9,7,'Амазон Услуга за Лесно Съхранение (Амазон S3) и Амазон Услуга\r\nза Продължително Съхранение (Glacier) - част 2',2,0,2),(9,8,'Амазон Ламбда',2,0,2),(9,9,'Сигурност в Амазон Уеб Услуги (AWS):\r\n- Амазон Услуга Охрана (GuardDuty);\r\n- Амазон Инспектор (Inspector);',2,0,2),(9,10,'Амазон Услуга за Еластично Балансиране',2,0,2),(9,11,'Амазон Услуга за Наблюдение на Облачното Пространство\r\n(CloudWatch)',2,0,2),(9,12,'Автоматично Скалиране (Auto Scaling)',2,0,2),(9,13,'AWS Услуга за Управление на Идентифицирането и на Достъпа\r\n(Identity and Access Management)',2,0,2),(9,14,'Бази Данни;\r\nАмазон Услуга “Обикновена Опашка“ (Amazon Simple Queue Service)\r\nи Амазон Услуга за „Обикновено Известяване“ (Amazon Simple\r\nnotification Service)',2,0,2),(9,15,'Амазон Услуги: DNS и Route 53;\r\nАмазон Услуги за Съхранение на Ключове;',2,0,2), (10,1,'Структури от данни, въведение в STL,\r\nзапознаване със състезателната система',0,0,15), (10,2,'Сортировки, търсене',0,0,10), (10,3,'Алгоритми върху графи',0,0,10), (10,4,'Динамично програмиране',0,0,10);
INSERT INTO `bibliographies` VALUES (9,1,'\"AWS Certified Solutions Architect - Official Study Guide\", Joe Baron, Hisham Baz, Tim\r\nBixler, Biff Gaut, Kevin E. Kelly, Sean Senior, John Stamper; 2017, John Wiley & Sons'),(9,2,'\"Architecting for the Cloud - AWS Best Practices\" (October 2018)\r\nhttps://d1.awsstatic.com/whitepapers/AWS_Cloud_Best_Practices.pdf'),(9,3,'\"AWS Security Best Practices (August 2016)\"'),(9,4,'\"Security Pillar - AWS Well-Architected Framework\" (July 2018)'),(9,5,'\"Serverless Architectures with AWS Lambda - Overview and Best Practices\" (November\r\n2017)\r\nhttps://d1.awsstatic.com/whitepapers/serverless-architectures-with-aws-lambda.pdf'),(9,6,'AWS Documentation - Guides and API References\r\nhttps://docs.aws.amazon.com/index.html#lang/en_us'),(10,1,'Introduction to Algorithms, Cormen, Leiserson, Rivest, 1989, ISBN 0-262-\r\n53091-0'),(10,2,'An Introduction to the Analysis of Algorithms, Sedgewick, Flajolet, 1996, ISBN\r\n0-201-40009-X'),(10,3,'The Algorithm Design Manual, second edition, Skiena, 2008-2010, ISBN 978-1-\r\n84800-069-8'),(10,4,'Approximation Algorithms, Vazirani, 2001-2003, ISBN 3-540-65367-8');
INSERT INTO `course_dependencies` VALUES
(1,2),
(2,3),
(3,1),
(3,4),
(4,5),
(5,6),
(3,6),
(10,9),
(6,10);

COMMIT;
